---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.GeometryElement
source: html/4c594aa0-de44-4759-9fe6-aa271aa5f4e3.htm
---
# GeometryElement Members

Causes the object to release immediately any resources it may be utilizing.